{
  "plugins": {
    "FixCursorHold.nvim": {
      "src": "https://github.com/antoinemadec/FixCursorHold.nvim",
      "version": "'1900f89dc17c603eec29960f57c00bd9ae696495'"
    },
    "autoclose.nvim": {
      "src": "https://github.com/m4xshen/autoclose.nvim",
      "version": "'3f86702b54a861a17d7994b2e32a7c648cb12fb1'"
    },
    "blink.cmp": {
      "src": "https://github.com/Saghen/blink.cmp",
      "version": "'v1.8.0'"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim",
      "version": "'v9.1.0'"
    },
    "fidget.nvim": {
      "src": "https://github.com/j-hui/fidget.nvim",
      "version": "'v1.6.1'"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/mason-org/mason-lspconfig.nvim",
      "version": "'v2.1.0'"
    },
    "mason-tool-installer.nvim": {
      "src": "https://github.com/WhoIsSethDaniel/mason-tool-installer.nvim",
      "version": "'517ef5994ef9d6b738322664d5fdd948f0fdeb46'"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim",
      "version": "'v2.1.0'"
    },
    "melange-nvim": {
      "src": "https://github.com/savq/melange-nvim",
      "version": "'2025-07-10'"
    },
    "mini-git": {
      "src": "https://github.com/nvim-mini/mini-git",
      "version": "'v0.16.0'"
    },
    "mini.diff": {
      "src": "https://github.com/nvim-mini/mini.diff",
      "version": "'v0.16.0'"
    },
    "neotest": {
      "src": "https://github.com/nvim-neotest/neotest",
      "version": "'v5.13.1'"
    },
    "neovim": {
      "src": "https://github.com/rose-pine/neovim",
      "version": "'v3.0.2'"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig",
      "version": "'v2.5.0'"
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio",
      "version": "'v1.10.1'"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons",
      "version": "'8dcb311b0c92d460fac00eac706abd43d94d68af'"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim",
      "version": "'v0.1.4'"
    },
    "rustaceanvim": {
      "src": "https://github.com/mrcjkb/rustaceanvim",
      "version": "'v7.0.6'"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim",
      "version": "'v0.2.0'"
    },
    "todo-comments.nvim": {
      "src": "https://github.com/folke/todo-comments.nvim",
      "version": "'v1.4.0'"
    },
    "typescript-tools.nvim": {
      "src": "https://github.com/pmizio/typescript-tools.nvim",
      "version": "'bf11d98ad5736e1cbc1082ca9a03196d45c701f1'"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim",
      "version": "'v3.17.0'"
    }
  }
}